### Edit Tables

In [1]:
# Ignore
%load_ext sql
%sql sqlite://
%config SqlMagic.feedback = False

/Users/Kavi/anaconda/lib/python3.6/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Users/Kavi/anaconda/lib/python3.6/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

### Create Data

In [2]:
%%sql

-- Create a table of criminals
CREATE TABLE criminals (pid, name, age, sex, city, minor);
INSERT INTO criminals VALUES (412, 'James Smith', 15, 'M', 'Santa Rosa', 1);
INSERT INTO criminals VALUES (901, 'Gordon Ado', 32, 'F', 'San Francisco', 0);
INSERT INTO criminals VALUES (512, 'Bill Byson', 21, 'M', 'Petaluma', 0);

[]

### View Table

In [4]:
%%sql

--  Select all from the criminals table

SELECT *
FROM criminals

[(412, 'James Smith', 15, 'M', 'Santa Rosa', 1),
 (901, 'Gordon Ado', 32, 'F', 'San Francisco', 0),
 (512, 'Bill Byson', 21, 'M', 'Petaluma', 0)]

### Update One Row

In [5]:
%%sql

-- Update the criminals table to say city: 'Palo Alto' if the prisoner ID number is 412

UPDATE criminals
SET City='Palo Alto'
WHERE pid=412

[]

### Update Multiple Rows Using A Conditional

In [6]:
%%sql

-- Update the criminals table to say minor: 'No' if age is greater than 12

UPDATE  criminals
SET minor='No'
WHERE age > 12;

[]

### View Table Again

In [7]:
%%sql

--  Select all from the criminals table

SELECT *
FROM criminals

[(412, 'James Smith', 15, 'M', 'Palo Alto', 'No'),
 (901, 'Gordon Ado', 32, 'F', 'San Francisco', 'No'),
 (512, 'Bill Byson', 21, 'M', 'Petaluma', 'No')]

Source: https://chrisalbon.com/sql/edit_tables.html